{"class_name": "Model", "keras_version": "1.1.1", "config": {"layers": [{"name": "main_input", "class_name": "InputLayer", "config": {"name": "main_input", "sparse": false, "input_dtype": "float32", "batch_input_shape": [[null, 19, 19, 18]]}, "inbound_nodes": []}, {"name": "conv2d0", "class_name": "Convolution2D", "config": {"name": "conv2d0", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["main_input", 0, 0]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d0", 0, 0]]]}, {"name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "activation": "relu", "trainable": false}, "inbound_nodes": [[["bn0", 0, 0]]]}, {"name": "conv2d1", "class_name": "Convolution2D", "config": {"name": "conv2d1", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu0", 0, 0]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"name": "bn1", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d1", 0, 0]]]}, {"name": "relu1", "class_name": "Activation", "config": {"name": "relu1", "activation": "relu", "trainable": false}, "inbound_nodes": [[["bn1", 0, 0]]]}, {"name": "conv2d2", "class_name": "Convolution2D", "config": {"name": "conv2d2", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu1", 0, 0]]]}, {"name": "bn2", "class_name": "BatchNormalization", "config": {"name": "bn2", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d2", 0, 0]]]}, {"name": "residual2", "class_name": "Merge", "config": {"name": "residual2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2", 0, 0], ["relu0", 0, 0]]]}, {"name": "relu2", "class_name": "Activation", "config": {"name": "relu2", "activation": "relu", "trainable": false}, "inbound_nodes": [[["residual2", 0, 0]]]}, {"name": "conv2d3", "class_name": "Convolution2D", "config": {"name": "conv2d3", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu2", 0, 0]]]}, {"name": "bn3", "class_name": "BatchNormalization", "config": {"name": "bn3", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d3", 0, 0]]]}, {"name": "relu3", "class_name": "Activation", "config": {"name": "relu3", "activation": "relu", "trainable": false}, "inbound_nodes": [[["bn3", 0, 0]]]}, {"name": "conv2d4", "class_name": "Convolution2D", "config": {"name": "conv2d4", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu3", 0, 0]]]}, {"name": "bn4", "class_name": "BatchNormalization", "config": {"name": "bn4", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d4", 0, 0]]]}, {"name": "residual4", "class_name": "Merge", "config": {"name": "residual4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4", 0, 0], ["relu2", 0, 0]]]}, {"name": "relu4", "class_name": "Activation", "config": {"name": "relu4", "activation": "relu", "trainable": false}, "inbound_nodes": [[["residual4", 0, 0]]]}, {"name": "conv2d5", "class_name": "Convolution2D", "config": {"name": "conv2d5", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu4", 0, 0]]]}, {"name": "bn5", "class_name": "BatchNormalization", "config": {"name": "bn5", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d5", 0, 0]]]}, {"name": "relu5", "class_name": "Activation", "config": {"name": "relu5", "activation": "relu", "trainable": false}, "inbound_nodes": [[["bn5", 0, 0]]]}, {"name": "conv2d6", "class_name": "Convolution2D", "config": {"name": "conv2d6", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu5", 0, 0]]]}, {"name": "bn6", "class_name": "BatchNormalization", "config": {"name": "bn6", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d6", 0, 0]]]}, {"name": "residual6", "class_name": "Merge", "config": {"name": "residual6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn6", 0, 0], ["relu4", 0, 0]]]}, {"name": "relu6", "class_name": "Activation", "config": {"name": "relu6", "activation": "relu", "trainable": false}, "inbound_nodes": [[["residual6", 0, 0]]]}, {"name": "conv2d7", "class_name": "Convolution2D", "config": {"name": "conv2d7", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu6", 0, 0]]]}, {"name": "bn7", "class_name": "BatchNormalization", "config": {"name": "bn7", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d7", 0, 0]]]}, {"name": "relu7", "class_name": "Activation", "config": {"name": "relu7", "activation": "relu", "trainable": false}, "inbound_nodes": [[["bn7", 0, 0]]]}, {"name": "conv2d8", "class_name": "Convolution2D", "config": {"name": "conv2d8", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu7", 0, 0]]]}, {"name": "bn8", "class_name": "BatchNormalization", "config": {"name": "bn8", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["conv2d8", 0, 0]]]}, {"name": "residual8", "class_name": "Merge", "config": {"name": "residual8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn8", 0, 0], ["relu6", 0, 0]]]}, {"name": "relu8", "class_name": "Activation", "config": {"name": "relu8", "activation": "relu", "trainable": false}, "inbound_nodes": [[["residual8", 0, 0]]]}, {"name": "pol!conv2d", "class_name": "Convolution2D", "config": {"name": "pol!conv2d", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 1, "nb_row": 1, "init": "glorot_uniform", "nb_filter": 2, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu8", 0, 0]]]}, {"name": "pol!bn", "class_name": "BatchNormalization", "config": {"name": "pol!bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["pol!conv2d", 0, 0]]]}, {"name": "pol!flatten", "class_name": "Flatten", "config": {"name": "pol!flatten"}, "inbound_nodes": [[["pol!bn", 0, 0]]]}, {"name": "pol!fc", "class_name": "Dense", "config": {"name": "pol!fc"}, "inbound_nodes": [[["pol!flatten", 0, 0]]]}, {"name": "val!conv2d", "class_name": "Convolution2D", "config": {"name": "val!conv2d", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "activation": "linear", "nb_col": 1, "nb_row": 1, "init": "glorot_uniform", "nb_filter": 1, "bias": true, "trainable": true, "subsample": [1, 1]}, "inbound_nodes": [[["relu8", 0, 0]]]}, {"name": "val!bn", "class_name": "BatchNormalization", "config": {"name": "val!bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": 3, "momentum": 0.0}, "inbound_nodes": [[["val!conv2d", 0, 0]]]}, {"name": "val!flatten", "class_name": "Flatten", "config": {"name": "val!flatten"}, "inbound_nodes": [[["val!bn", 0, 0]]]}, {"name": "val!fc1", "class_name": "Dense", "config": {"name": "val!fc1"}, "inbound_nodes": [[["val!flatten", 0, 0]]]}, {"name": "val!relu", "class_name": "Activation", "config": {"name": "val!relu", "activation": "relu", "trainable": false}, "inbound_nodes": [[["val!fc1", 0, 0]]]}, {"name": "val!fc2", "class_name": "Dense", "config": {"name": "val!fc2"}, "inbound_nodes": [[["val!relu", 0, 0]]]}, {"name": "val!tanh", "class_name": "Activation", "config": {"name": "val!tanh", "activation": "tanh", "trainable": false}, "inbound_nodes": [[["val!fc2", 0, 0]]]}], "input_layers": [["main_input", 0, 0]], "output_layers": [["val!tanh", 0, 0], ["pol!fc"]]}}